tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationMqttAdapter.cpp
#include "IrrigationMqttAdapter.h"

#include <Arduino.h>
#include <ArduinoJson.h>
#include <Esp32Base.h>
#include <esp_crt_bundle.h>
#include <esp_system.h>
#include <mbedtls/sha256.h>

#include <algorithm>
#include <cstdio>
#include <cstring>

#include "FlowMonitor.h"
#include "IrrigationApp.h"
#include "IrrigationConfig.h"

#if __has_include("../../local_private/IrrigationMqttPrivate.h")
#include "../../local_private/IrrigationMqttPrivate.h"
#else
#define IRRIGATION_MQTT_ENABLED 0
#define IRRIGATION_MQTT_BROKER_URI ""
#define IRRIGATION_MQTT_DEVICE_ID ""
#define IRRIGATION_MQTT_CLIENT_ID ""
#define IRRIGATION_MQTT_USERNAME ""
#define IRRIGATION_MQTT_PASSWORD ""
#define IRRIGATION_MQTT_DEFINITION_SHA256 ""
#endif

namespace {

constexpr uint32_t kReconnectDelayMs = 5000U;
constexpr uint32_t kActiveRuntimeIntervalMs = 1000U;
constexpr uint32_t kIdleRuntimeIntervalMs = 5000U;
constexpr uint32_t kProgressIntervalMs = 5000U;
constexpr uint32_t kFullStateIntervalMs =
    IrrigationPlatformProtocol::kStateFreshnessSeconds * 800U;

bool validIdentity(const char* value) {
    if (!value) return false;
    const std::size_t length = std::strlen(value);
    if (length == 0 || length > 64) return false;
    for (std::size_t index = 0; index < length; ++index) {
        const char ch = value[index];
        if (!((ch >= 'a' && ch <= 'z') || (ch >= '0' && ch <= '9') ||
              (ch == '-' && index != 0))) return false;
    }
    return true;
}

const char* wateringFailure(WateringStopReason reason) {
    switch (reason) {
        case WateringStopReason::UserStopped: return "stopped";
        case WateringStopReason::FlowStartTimeout: return "flow_start_timeout";
        case WateringStopReason::NoFlowTimeout: return "no_flow";
        case WateringStopReason::LowFlow: return "low_flow";
        case WateringStopReason::HighFlow: return "high_flow";
        case WateringStopReason::LearningTimeout: return "learning_timeout";
        case WateringStopReason::HardwareFailure: return "hardware_failure";
        case WateringStopReason::MaintenanceInterrupted: return "maintenance_interrupted";
        case WateringStopReason::TargetVolumeTimeout: return "target_volume_timeout";
        default: return "internal_state";
    }
}

const char* automaticModeName(AutomaticWateringMode mode) {
    switch (mode) {
        case AutomaticWateringMode::Enabled: return "enabled";
        case AutomaticWateringMode::PausedIndefinitely: return "paused-indefinitely";
        case AutomaticWateringMode::PausedUntil: return "paused-until";
    }
    return "enabled";
}

const char* flowActionName(FlowAlertAction action) {
    return action == FlowAlertAction::StopWatering ? "stop" : "alert";
}

const char* wateringSourceName(WateringSource source) {
    switch (source) {
        case WateringSource::ManualZones: return "manual";
        case WateringSource::SingleOutput: return "single-output";
        case WateringSource::AutomaticPlan: return "automatic";
    }
    return "manual";
}

const char* wateringResultName(WateringResult result) {
    switch (result) {
        case WateringResult::Completed: return "completed";
        case WateringResult::Stopped: return "stopped";
        case WateringResult::Failed: return "failed";
        default: return "failed";
    }
}

const char* zoneResultName(ZoneWateringResult result) {
    switch (result) {
        case ZoneWateringResult::Completed: return "completed";
        case ZoneWateringResult::Stopped: return "stopped";
        case ZoneWateringResult::Failed: return "failed";
        default: return "not-started";
    }
}

uint32_t fingerprint(const WateringStatus& status,
                     const AutomaticWateringState& automatic,
                     bool ready) {
    uint32_t value = ready ? 2166136261U : 16777619U;
    const uint32_t items[] = {
        status.active, static_cast<uint32_t>(status.state),
        static_cast<uint32_t>(status.source), status.planId, status.activeZoneId,
        status.currentStepIndex, status.elapsedSec, status.currentZoneElapsedSec,
        status.currentZoneRemainingSec, status.pulseCount,
        status.currentFlowMlPerMinute, static_cast<uint32_t>(status.lastResult),
        static_cast<uint32_t>(status.lastStopReason),
        static_cast<uint32_t>(automatic.mode), automatic.resumeAtEpoch,
    };
    for (uint32_t item : items) {
        value ^= item;
        value *= 16777619U;
    }
    return value;
}

}  // namespace

bool IrrigationMqttAdapter::begin(IrrigationApp& app) {
    app_ = &app;
    if (IRRIGATION_MQTT_ENABLED != 1) {
        ESP32BASE_LOG_I("irrigation_mqtt", "platform_mqtt_disabled_no_private_config");
        return true;
    }
    if (std::strncmp(IRRIGATION_MQTT_BROKER_URI, "mqtts://", 8) != 0 ||
        !validIdentity(IRRIGATION_MQTT_DEVICE_ID) ||
        !validIdentity(IRRIGATION_MQTT_CLIENT_ID) ||
        IRRIGATION_MQTT_USERNAME[0] == '\0' || IRRIGATION_MQTT_PASSWORD[0] == '\0' ||
        std::strcmp(IRRIGATION_MQTT_DEFINITION_SHA256,
                    IrrigationPlatformProtocol::kDefinitionSha256) != 0) {
        ESP32BASE_LOG_E("irrigation_mqtt", "private_config_invalid_or_definition_mismatch");
        return false;
    }
    if (!preferences_.begin("irr_mqtt", false) || !loadHistory()) {
        ESP32BASE_LOG_E("irrigation_mqtt", "command_history_unavailable");
        return false;
    }
    enabled_ = true;
    reconnectAtMs_ = millis();
    return true;
}

void IrrigationMqttAdapter::handle() {
    if (!enabled_ || !app_) return;
    const uint32_t now = millis();
    if (restartPending_ && static_cast<int32_t>(now - reconnectAtMs_) >= 0) {
        stopClient();
        restartPending_ = false;
    }
    if (!client_ && !restartPending_ &&
        static_cast<int32_t>(now - reconnectAtMs_) >= 0 &&
        Esp32BaseTime::snapshot().synced) {
        if (!startClient()) reconnectAtMs_ = now + kReconnectDelayMs;
    }

    QueuedPacket packet;
    if (popIncoming(packet)) processPacket(packet);
    updateRemoteOperation();
    if (!connected_) return;

    if (replayProgressPending_) {
        for (const HistoryEntry& entry : history_.entries()) {
            if (entry.used && IrrigationMqttCore::shouldReplayProgress(entry.progress))
                publishProgress(entry);
        }
        replayProgressPending_ = false;
    }

