tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationMqttAdapter.cpp
    if ((remoteOperation_.hasActive() || remoteOperation_.hasPendingStop()) &&
        static_cast<uint32_t>(now - lastProgressPublishMs_) >= kProgressIntervalMs) {
        if (remoteOperation_.hasActive()) {
            if (HistoryEntry* entry = findHistory(remoteOperation_.activeCommandId()))
                publishProgress(*entry);
        }
        if (remoteOperation_.hasPendingStop()) {
            if (HistoryEntry* entry = findHistory(remoteOperation_.pendingStopCommandId()))
                publishProgress(*entry);
        }
        lastProgressPublishMs_ = now;
    }

    const IrrigationConfig* config = app_->configuration();
    const WateringStatus status = app_->wateringStatus();
    const AutomaticWateringState automatic = app_->automaticWateringState();
    const uint32_t currentFingerprint = fingerprint(status, automatic, app_->businessReady());
    if (publishAllPending_ ||
        static_cast<uint32_t>(now - lastStatePublishMs_) >= kFullStateIntervalMs ||
        (config && config->revision != lastConfigRevision_)) {
        publishAllState();
        publishAllPending_ = false;
        lastStatePublishMs_ = now;
        lastRuntimePublishMs_ = now;
        lastConfigRevision_ = config ? config->revision : 0;
        lastRuntimeFingerprint_ = currentFingerprint;
    } else {
        const uint32_t interval = status.active ? kActiveRuntimeIntervalMs
                                                : kIdleRuntimeIntervalMs;
        if (currentFingerprint != lastRuntimeFingerprint_ ||
            static_cast<uint32_t>(now - lastRuntimePublishMs_) >= interval) {
            publishRuntime();
            lastRuntimePublishMs_ = now;
            lastRuntimeFingerprint_ = currentFingerprint;
        }
    }
    publishNextWateringEvent();
    publishNextAppEvent();
}

bool IrrigationMqttAdapter::enabled() const { return enabled_; }
bool IrrigationMqttAdapter::connected() const { return connected_; }

esp_err_t IrrigationMqttAdapter::mqttEvent(esp_mqtt_event_handle_t event) {
    if (event && event->user_context)
        static_cast<IrrigationMqttAdapter*>(event->user_context)->onMqttEvent(event);
    return ESP_OK;
}

void IrrigationMqttAdapter::onMqttEvent(esp_mqtt_event_handle_t event) {
    switch (event->event_id) {
        case MQTT_EVENT_CONNECTED: {
            connected_ = true;
            char topic[192]{};
            makeTopic(IrrigationMqttCore::Channel::Command, topic, sizeof(topic));
            esp_mqtt_client_subscribe(client_, topic, 1);
            const auto decision = IrrigationMqttCore::connectedDecision();
            if (decision.publishOnlineAvailability) publishAvailability(true);
            publishAllPending_ = decision.publishFullState;
            lastProgressPublishMs_ = millis();
            wateringEventCursor_.disconnected();
            prepareWateringEventCursor();
            appEventCursor_.disconnected();
            prepareAppEventCursor();
            replayProgressPending_ = decision.replayKnownProgress;
            ESP32BASE_LOG_I("irrigation_mqtt", "connected");
            break;
        }
        case MQTT_EVENT_DISCONNECTED:
            connected_ = false;
            wateringEventCursor_.disconnected();
            appEventCursor_.disconnected();
            restartPending_ = true;
            reconnectAtMs_ = millis() + kReconnectDelayMs;
            ESP32BASE_LOG_W("irrigation_mqtt", "disconnected_reconnect_scheduled");
            break;
        case MQTT_EVENT_DATA:
            queueIncoming(*event);
            break;
        case MQTT_EVENT_PUBLISHED:
            if (const uint32_t recordId =
                    wateringEventCursor_.matchingAckRecord(event->msg_id)) {
                const bool saved = preferences_.putUInt("watering_cursor", recordId) ==
                                   sizeof(recordId);
                wateringEventCursor_.commitAck(event->msg_id, saved);
            }
            if (const uint32_t recordId =
                    appEventCursor_.matchingAckRecord(event->msg_id)) {
                const bool saved = preferences_.putUInt("app_evt_cursor", recordId) ==
                                   sizeof(recordId);
                appEventCursor_.commitAck(event->msg_id, saved);
            }
            break;
        case MQTT_EVENT_ERROR:
            ESP32BASE_LOG_W("irrigation_mqtt", "transport_error");
            break;
        default:
            break;
    }
}

bool IrrigationMqttAdapter::startClient() {
    makeConnectionId();
    makeTopic(IrrigationMqttCore::Channel::Availability,
              availabilityTopic_.data(), availabilityTopic_.size());
    std::snprintf(lwtPayload_.data(), lwtPayload_.size(),
                  "{\"protocol\":\"%s\",\"online\":false,\"connectionId\":\"%s\",\"reason\":\"lwt\"}",
                  IrrigationPlatformProtocol::kProtocol, connectionId_.data());
    esp_mqtt_client_config_t config{};
    config.event_handle = mqttEvent;
    config.uri = IRRIGATION_MQTT_BROKER_URI;
    config.client_id = IRRIGATION_MQTT_CLIENT_ID;
    config.username = IRRIGATION_MQTT_USERNAME;
    config.password = IRRIGATION_MQTT_PASSWORD;
    config.lwt_topic = availabilityTopic_.data();
    config.lwt_msg = lwtPayload_.data();
    config.lwt_msg_len = std::strlen(lwtPayload_.data());
    const auto lwtPolicy =
        IrrigationMqttCore::publicationPolicy(IrrigationMqttCore::Channel::Availability);
    config.lwt_qos = lwtPolicy.qos;
    config.lwt_retain = lwtPolicy.retain;
    config.disable_clean_session = 0;
    config.disable_auto_reconnect = true;
    config.keepalive = 60;
    config.buffer_size = 4096;
    config.out_buffer_size = 4096;
    config.network_timeout_ms = 10000;
    config.reconnect_timeout_ms = 5000;
    config.protocol_ver = MQTT_PROTOCOL_V_3_1_1;
    config.crt_bundle_attach = arduino_esp_crt_bundle_attach;
    config.skip_cert_common_name_check = false;
    config.user_context = this;
    client_ = esp_mqtt_client_init(&config);
    if (!client_ || esp_mqtt_client_start(client_) != ESP_OK) {
        stopClient();
        return false;
    }
    return true;
}

void IrrigationMqttAdapter::stopClient() {
    connected_ = false;
    if (!client_) return;
    esp_mqtt_client_stop(client_);
    esp_mqtt_client_destroy(client_);
    client_ = nullptr;
    assemblyLength_ = 0;
    assemblyExpected_ = 0;
}

void IrrigationMqttAdapter::queueIncoming(const esp_mqtt_event_t& event) {
    if (event.current_data_offset == 0) {
        char expectedTopic[192]{};
        makeTopic(IrrigationMqttCore::Channel::Command,
                  expectedTopic, sizeof(expectedTopic));
        if (!event.topic || event.topic_len != static_cast<int>(std::strlen(expectedTopic)) ||
            std::memcmp(event.topic, expectedTopic, event.topic_len) != 0 ||
            event.total_data_len <= 0 ||
            event.total_data_len > static_cast<int>(IrrigationPlatformProtocol::kMaximumCommandBytes)) {
            assemblyExpected_ = 0;
            return;
        }
        assemblyExpected_ = static_cast<uint16_t>(event.total_data_len);
        assemblyLength_ = 0;
        assemblyQos_ = static_cast<uint8_t>(event.qos);
        assemblyRetain_ = event.retain;
    }
    if (assemblyExpected_ == 0 || event.current_data_offset != assemblyLength_ ||
        event.data_len < 0 || assemblyLength_ + event.data_len > assemblyExpected_) {
        assemblyExpected_ = 0;
        assemblyLength_ = 0;
        return;
    }
    std::memcpy(assembly_.data() + assemblyLength_, event.data,
                static_cast<std::size_t>(event.data_len));
    assemblyLength_ += static_cast<uint16_t>(event.data_len);
    if (assemblyLength_ != assemblyExpected_) return;
    assembly_[assemblyLength_] = '\0';
    const bool stop = IrrigationMqttCore::isStopCommandEnvelope(
        assembly_.data(), assemblyLength_);
    portENTER_CRITICAL(&queueMux_);
    const auto queued = commandQueue_.pushClassified(
        assembly_.data(), assemblyLength_, assemblyQos_, assemblyRetain_, stop);
    portEXIT_CRITICAL(&queueMux_);
    if (queued == IrrigationMqttCore::QueuePushResult::NormalSlotFull)
        ESP32BASE_LOG_W("irrigation_mqtt", "normal_command_queue_full");
    else if (queued == IrrigationMqttCore::QueuePushResult::StopSlotFull)
        ESP32BASE_LOG_W("irrigation_mqtt", "stop_already_queued");
    else if (queued == IrrigationMqttCore::QueuePushResult::InvalidTransport)
        ESP32BASE_LOG_W("irrigation_mqtt", "invalid_command_qos_or_retain");
    assemblyExpected_ = 0;
    assemblyLength_ = 0;
}

bool IrrigationMqttAdapter::popIncoming(QueuedPacket& packet) {
    portENTER_CRITICAL(&queueMux_);
    const bool found = commandQueue_.pop(packet);
    portEXIT_CRITICAL(&queueMux_);
    return found;
}

void IrrigationMqttAdapter::processPacket(const QueuedPacket& packet) {
    if (!IrrigationMqttCore::acceptsCommandTransport(packet.qos, packet.retain)) {
        ESP32BASE_LOG_W("irrigation_mqtt", "invalid_command_qos_or_retain");
        return;
    }
    IrrigationPlatformProtocol::Command command;
    if (IrrigationPlatformProtocol::parseCommand(packet.payload.data(), packet.length,
                                                  command) !=
        IrrigationPlatformProtocol::ParseResult::Ok) {
        ESP32BASE_LOG_W("irrigation_mqtt", "invalid_command_payload");
        return;
    }
    std::array<uint8_t, 32> signature{};
    if (!commandSignature(command, signature)) return;
    const auto admission = history_.admit(
        command.commandId.data(), signature, command.expiresAtMs,
        command.capability, nowMs());
    if (admission.result == IrrigationMqttCore::Admission::Replay) {
        replay(*admission.entry);
        return;
    }
    if (admission.result == IrrigationMqttCore::Admission::Conflict) return;
    if (admission.result == IrrigationMqttCore::Admission::Full) {
        HistoryEntry temporary{};
        temporary.used = true;
        temporary.capability = command.capability;
        temporary.receipt = EvidenceStatus::Rejected;
        std::snprintf(temporary.commandId.data(), temporary.commandId.size(), "%s",
                      command.commandId.data());
        std::snprintf(temporary.reason.data(), temporary.reason.size(), "%s",
                      "persistence_error");
        publishReceipt(temporary);
        return;
    }
    execute(command, *admission.entry);
}

void IrrigationMqttAdapter::execute(
    const IrrigationPlatformProtocol::Command& command,
    HistoryEntry& history) {
    const char* rejection = evaluate(command);
    if (rejection) {
        history_.markRejected(history, rejection);
        if (!saveHistory()) return;
        publishReceipt(history);
        return;
    }
    history_.markAccepted(history);
    if (!saveHistory()) {
        HistoryEntry temporary = history;
        temporary.receipt = EvidenceStatus::Rejected;
        std::snprintf(temporary.reason.data(), temporary.reason.size(), "%s",
                      "persistence_error");
        history = {};
        publishReceipt(temporary);
        return;
    }
    publishReceipt(history);
    setProgress(history, EvidenceStatus::Running);

    if (command.capability == IrrigationPlatformProtocol::Capability::Plans) {
        if (applyPlans(command)) {
            setProgress(history, EvidenceStatus::Succeeded);
            publishPlans();
            publishRuntime();
        } else {
            setProgress(history, EvidenceStatus::Failed, "persistence_error");
        }
        return;
    }
    if (command.capability ==
        IrrigationPlatformProtocol::Capability::AutomaticWatering) {
        bool saved = false;
        if (command.automaticMode == AutomaticWateringMode::Enabled)
            saved = app_->resumeAutomaticWatering();
        else if (command.automaticMode == AutomaticWateringMode::PausedIndefinitely)
            saved = app_->pauseAutomaticWateringIndefinitely();
        else
            saved = app_->pauseAutomaticWateringUntil(command.resumeAtEpoch);
        if (saved) {
            setProgress(history, EvidenceStatus::Succeeded);
            publishAutomatic();
            publishRuntime();
        } else {
            setProgress(history, EvidenceStatus::Failed, "persistence_error");
        }
        return;
    }
    if (command.capability == IrrigationPlatformProtocol::Capability::Stop) {
        const WateringStatus status = app_->wateringStatus();
        if (!status.active) {
            remoteOperation_.requestStop(command.commandId.data());
            const auto completion = remoteOperation_.completeIdleStop();
            for (uint8_t index = 0; index < completion.count; ++index) {
                const auto& update = completion.updates[index];
                if (HistoryEntry* entry = findHistory(update.commandId.data()))
                    setProgress(*entry, update.status, update.reason);
            }
            return;
        }
        if (!app_->stopWatering()) {
            setProgress(history, EvidenceStatus::Failed, "hardware_failure");
            return;
        }
        remoteOperation_.requestStop(command.commandId.data());
        return;
    }

    WateringStartResult result = WateringStartResult::InvalidRequest;
    if (command.capability == IrrigationPlatformProtocol::Capability::StartManual) {
        std::array<uint16_t, BoardPins::kZoneCount> durations{};
        for (uint8_t index = 0; index < command.zoneCount; ++index)
            durations[BoardPins::zoneIndex(command.zones[index].zoneId)] =
                command.zones[index].durationMinutes;
        result = app_->startManualWatering(durations);
    } else {
        const IrrigationConfig* config = app_->configuration();
        const uint32_t duration = command.targetWaterMl != 0 && config
                                      ? static_cast<uint32_t>(
                                            config->runLimits.maximumZoneDurationMinutes) * 60U
                                      : command.durationSeconds;
        result = app_->startSingleOutput(command.zoneId, duration,
                                         command.targetWaterMl);
    }
    if (result != WateringStartResult::Started) {
        setProgress(history, EvidenceStatus::Failed, rejectionForStart(result));
        return;
    }
    remoteOperation_.start(command.commandId.data());
    publishRuntime();
}

const char* IrrigationMqttAdapter::evaluate(
    const IrrigationPlatformProtocol::Command& command) const {
    const Esp32BaseTime::Snapshot time = Esp32BaseTime::snapshot();
    if (!time.synced) return "time_untrusted";
    if (command.expiresAtMs <= static_cast<uint64_t>(time.epochSec) * 1000ULL)
        return "expired";
    if (!app_->businessReady()) return "not_ready";
    const IrrigationConfig* config = app_->configuration();
    if (!config) return "not_ready";
    const WateringStatus status = app_->wateringStatus();
    if (command.capability == IrrigationPlatformProtocol::Capability::Stop) {
        if (status.active && status.purpose != WateringPurpose::Normal)
            return "maintenance_activity";
        return nullptr;
    }
    if (command.capability == IrrigationPlatformProtocol::Capability::Plans) {
        IrrigationConfig next{};
        return buildPlans(command, next);
    }
    if (command.capability ==
        IrrigationPlatformProtocol::Capability::AutomaticWatering) {
        if (command.automaticMode == AutomaticWateringMode::PausedUntil) {
            if (app_->schedulerTimeState() != WateringScheduler::TimeState::Ready)
                return "time_untrusted";
            if (command.resumeAtEpoch <= time.epochSec) return "invalid_resume_time";
        }
        return nullptr;
    }
    if (status.active || remoteOperation_.hasActive()) return "busy";
    if (command.capability == IrrigationPlatformProtocol::Capability::StartManual) {
        for (uint8_t index = 0; index < command.zoneCount; ++index) {
            const auto& zone = command.zones[index];
            if (!config->zones[BoardPins::zoneIndex(zone.zoneId)].enabled)
                return "zone_unavailable";
            if (zone.durationMinutes > config->runLimits.maximumZoneDurationMinutes)
                return "duration_limit";
        }
        return nullptr;
    }
    if (!config->zones[BoardPins::zoneIndex(command.zoneId)].enabled)
        return "zone_unavailable";
    if (command.targetWaterMl == 0 && command.durationSeconds >
        static_cast<uint32_t>(config->runLimits.maximumZoneDurationMinutes) * 60U)
        return "duration_limit";
    if (command.targetWaterMl >
        static_cast<uint32_t>(config->runLimits.maximumSingleOutputLiters) * 1000U)
        return "volume_limit";
    return nullptr;
}

