tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationMqttAdapter.cpp
bool IrrigationMqttAdapter::applyPlans(
    const IrrigationPlatformProtocol::Command& command) {
    IrrigationConfig next{};
    if (buildPlans(command, next)) return false;
    return app_->saveConfiguration(next, command.revision,
                                   IrrigationEvents::ConfigurationChange::PlanUpdated);
}

const char* IrrigationMqttAdapter::buildPlans(
    const IrrigationPlatformProtocol::Command& command,
    IrrigationConfig& next) const {
    const IrrigationConfig* current = app_->configuration();
    if (!current) return "not_ready";
    if (command.revision != current->revision) return "revision_conflict";
    next = *current;
    for (WateringPlan& plan : next.plans) {
        const IrrigationPlatformProtocol::PlanValue* requested = nullptr;
        for (uint8_t index = 0; index < command.planCount; ++index) {
            if (command.plans[index].id == plan.id) {
                requested = &command.plans[index];
                break;
            }
        }
        if (!requested) {
            plan = {};
            plan.id = static_cast<uint8_t>(&plan - next.plans.data() + 1U);
            plan.startMinutes.fill(kUnusedStartMinute);
            continue;
        }
        plan.configured = true;
        plan.scheduleEnabled = requested->automaticEnabled;
        std::snprintf(plan.name.data(), plan.name.size(), "%s", requested->name.data());
        plan.startMinutes.fill(kUnusedStartMinute);
        for (uint8_t index = 0; index < requested->startCount; ++index)
            plan.startMinutes[index] = requested->startMinutes[index];
        for (uint8_t zoneIndex = 0; zoneIndex < next.zones.size(); ++zoneIndex) {
            if (next.zones[zoneIndex].enabled) plan.zoneDurationMinutes[zoneIndex] = 0;
        }
        for (uint8_t index = 0; index < requested->zoneCount; ++index) {
            const auto& zone = requested->zones[index];
            if (!next.zones[BoardPins::zoneIndex(zone.zoneId)].enabled)
                return "zone_unavailable";
            if (zone.durationMinutes > next.runLimits.maximumZoneDurationMinutes)
                return "duration_limit";
            plan.zoneDurationMinutes[BoardPins::zoneIndex(zone.zoneId)] =
                zone.durationMinutes;
        }
    }
    return IrrigationConfigRules::validateRuntimeConstraints(next)
               ? nullptr
               : "plan_conflict";
}

void IrrigationMqttAdapter::updateRemoteOperation() {
    const WateringStatus status = app_->wateringStatus();
    if (!status.active && remoteOperation_.hasPendingStop()) {
        const auto completion = remoteOperation_.completeStoppedOperation();
        for (uint8_t index = 0; index < completion.count; ++index) {
            const auto& update = completion.updates[index];
            if (HistoryEntry* entry = findHistory(update.commandId.data()))
                setProgress(*entry, update.status, update.reason);
        }
        publishRuntime();
        return;
    }
    if (!remoteOperation_.hasActive()) return;
    HistoryEntry* entry = findHistory(remoteOperation_.activeCommandId());
    if (!status.active) {
        const bool succeeded = status.lastResult == WateringResult::Completed;
        const auto update = remoteOperation_.completeOperation(
            succeeded ? EvidenceStatus::Succeeded : EvidenceStatus::Failed,
            succeeded ? nullptr : wateringFailure(status.lastStopReason));
        if (entry) setProgress(*entry, update.status, update.reason);
        publishRuntime();
    }
}

IrrigationMqttAdapter::HistoryEntry* IrrigationMqttAdapter::findHistory(
    const char* commandId) {
    return history_.find(commandId);
}

bool IrrigationMqttAdapter::loadHistory() {
    const std::size_t stored = preferences_.getBytesLength("history");
    if (stored == 0) {
        history_.entries() = {};
        return true;
    }
    auto& entries = history_.entries();
    if (stored != sizeof(entries) ||
        preferences_.getBytes("history", entries.data(), sizeof(entries)) !=
            sizeof(entries)) {
        return false;
    }
    if (!history_.validate()) return false;
    const bool reconciled = history_.reconcileAfterRestart();
    return !reconciled || saveHistory();
}

bool IrrigationMqttAdapter::saveHistory() {
    auto& entries = history_.entries();
    return preferences_.putBytes("history", entries.data(), sizeof(entries)) ==
           sizeof(entries);
}

bool IrrigationMqttAdapter::commandSignature(
    const IrrigationPlatformProtocol::Command& command,
    std::array<uint8_t, 32>& signature) const {
    char canonical[3072]{};
    return IrrigationPlatformProtocol::canonicalizeCommand(
               command, canonical, sizeof(canonical)) &&
           mbedtls_sha256_ret(reinterpret_cast<const unsigned char*>(canonical),
                              std::strlen(canonical), signature.data(), 0) == 0;
}

void IrrigationMqttAdapter::replay(const HistoryEntry& entry) {
    publishReceipt(entry);
    if (entry.progress != EvidenceStatus::None) publishProgress(entry);
}

void IrrigationMqttAdapter::publishReceipt(const HistoryEntry& entry) {
    if (!connected_) return;
    char observed[25]{};
    if (!observedAt(observed, sizeof(observed))) return;
    char payload[512]{};
    if (entry.receipt == EvidenceStatus::Accepted) {
        std::snprintf(payload, sizeof(payload),
                      "{\"protocol\":\"%s\",\"connectionId\":\"%s\",\"commandId\":\"%s\",\"capabilityKey\":\"%s\",\"status\":\"accepted\",\"observedAt\":\"%s\"}",
                      IrrigationPlatformProtocol::kProtocol, connectionId_.data(),
                      entry.commandId.data(),
                      IrrigationPlatformProtocol::capabilityKey(entry.capability), observed);
    } else {
        std::snprintf(payload, sizeof(payload),
                      "{\"protocol\":\"%s\",\"connectionId\":\"%s\",\"commandId\":\"%s\",\"capabilityKey\":\"%s\",\"status\":\"rejected\",\"reason\":\"%s\",\"observedAt\":\"%s\"}",
                      IrrigationPlatformProtocol::kProtocol, connectionId_.data(),
                      entry.commandId.data(),
                      IrrigationPlatformProtocol::capabilityKey(entry.capability),
                      entry.reason.data(), observed);
    }
    enqueue(IrrigationMqttCore::Channel::Receipt, payload);
}

void IrrigationMqttAdapter::publishProgress(const HistoryEntry& entry) {
    if (!connected_ || !IrrigationMqttCore::shouldReplayProgress(entry.progress)) return;
    char observed[25]{};
    if (!observedAt(observed, sizeof(observed))) return;
    const char* status = entry.progress == EvidenceStatus::Running
                             ? "running"
                             : entry.progress == EvidenceStatus::Succeeded ? "succeeded"
                                                                           : "failed";
    char payload[512]{};
    if (entry.progress == EvidenceStatus::Failed) {
        std::snprintf(payload, sizeof(payload),
                      "{\"protocol\":\"%s\",\"connectionId\":\"%s\",\"commandId\":\"%s\",\"capabilityKey\":\"%s\",\"status\":\"%s\",\"reason\":\"%s\",\"observedAt\":\"%s\"}",
                      IrrigationPlatformProtocol::kProtocol, connectionId_.data(),
                      entry.commandId.data(),
                      IrrigationPlatformProtocol::capabilityKey(entry.capability), status,
                      entry.reason.data(), observed);
    } else {
        std::snprintf(payload, sizeof(payload),
                      "{\"protocol\":\"%s\",\"connectionId\":\"%s\",\"commandId\":\"%s\",\"capabilityKey\":\"%s\",\"status\":\"%s\",\"observedAt\":\"%s\"}",
                      IrrigationPlatformProtocol::kProtocol, connectionId_.data(),
                      entry.commandId.data(),
                      IrrigationPlatformProtocol::capabilityKey(entry.capability), status,
                      observed);
    }
    enqueue(IrrigationMqttCore::Channel::Progress, payload);
}

