tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationMqttAdapter.cpp
void IrrigationMqttAdapter::setProgress(HistoryEntry& entry,
                                        EvidenceStatus status,
                                        const char* reason) {
    const bool changed = status == EvidenceStatus::Running
                             ? history_.markRunning(entry)
                             : history_.markTerminal(entry, status, reason);
    if (!changed) return;
    if (!saveHistory()) {
        ESP32BASE_LOG_E("irrigation_mqtt", "command_evidence_save_failed");
        return;
    }
    publishProgress(entry);
}

void IrrigationMqttAdapter::publishAllState() {
    publishRuntime();
    publishPlans();
    publishAutomatic();
    publishZones();
    publishZoneMaintenance();
    publishCalibration();
    publishSystemParameters();
}

void IrrigationMqttAdapter::publishRuntime() {
    if (!connected_ || !app_) return;
    const IrrigationConfig* config = app_->configuration();
    const WateringStatus status = app_->wateringStatus();
    const Esp32BaseTime::Snapshot time = Esp32BaseTime::snapshot();
    const AutomaticWateringState automatic = app_->automaticWateringState();
    const NextAutomaticWatering next = app_->nextAutomaticWatering();
    JsonDocument document;
    document["ready"] = app_->businessReady();
    const char* readyReason = "none";
    if (!app_->businessReady()) {
        readyReason = app_->configurationLoadResult() ==
                              IrrigationConfigStore::LoadResult::InvalidConfig
                          ? "configuration_unavailable"
                          : "startup_check_failed";
    }
    document["readyReason"] = readyReason;
    JsonObject timeValue = document["time"].to<JsonObject>();
    const bool trusted = time.synced &&
                         app_->schedulerTimeState() == WateringScheduler::TimeState::Ready;
    timeValue["trusted"] = trusted;
    timeValue["source"] = time.synced
                              ? (time.source == Esp32BaseTime::SOURCE_NTP ? "ntp" : "rtc")
                              : "none";
    if (time.synced) timeValue["epoch"] = time.epochSec;
    else timeValue["epoch"] = nullptr;
    timeValue["rtcAvailable"] = Esp32BaseRtc::isAvailable();
    timeValue["rtcRollback"] =
        app_->schedulerTimeState() == WateringScheduler::TimeState::RtcRollback;
    JsonObject nextValue = document["nextAutomatic"].to<JsonObject>();
    if (automatic.mode == AutomaticWateringMode::PausedUntil) {
        nextValue["status"] = "paused-until";
        nextValue["planId"] = nullptr;
        nextValue["scheduledAtEpoch"] = automatic.resumeAtEpoch;
    } else {
        const char* nextStatus = "time-unavailable";
        switch (next.status) {
            case NextAutomaticWateringStatus::Available: nextStatus = "available"; break;
            case NextAutomaticWateringStatus::NoEnabledPlans: nextStatus = "no-enabled-plans"; break;
            case NextAutomaticWateringStatus::TimeUnavailable: nextStatus = "time-unavailable"; break;
            case NextAutomaticWateringStatus::RtcRollback: nextStatus = "rtc-rollback"; break;
            case NextAutomaticWateringStatus::PausedIndefinitely: nextStatus = "paused-indefinitely"; break;
        }
        nextValue["status"] = nextStatus;
        if (next.status == NextAutomaticWateringStatus::Available) {
            nextValue["planId"] = next.planId;
            nextValue["scheduledAtEpoch"] = next.scheduledEpoch;
        } else {
            nextValue["planId"] = nullptr;
            nextValue["scheduledAtEpoch"] = nullptr;
        }
    }
    JsonObject activity = document["activity"].to<JsonObject>();
    activity["kind"] = activityKind(status);
    if (remoteOperation_.hasActive() && status.active)
        activity["commandId"] = remoteOperation_.activeCommandId();
    else activity["commandId"] = nullptr;
    if (status.active && BoardPins::isValidZoneId(status.activeZoneId))
        activity["zoneId"] = status.activeZoneId;
    else activity["zoneId"] = nullptr;
    activity["phase"] = status.active ? phaseName(status.state) : "idle";
    activity["elapsedSeconds"] = status.elapsedSec;
    activity["remainingSeconds"] = status.plannedRemainingSec;
    if (status.active && status.currentZoneTargetWaterMl == 0)
        activity["targetDurationSeconds"] = status.currentZoneElapsedSec +
                                                status.currentZoneRemainingSec;
    else activity["targetDurationSeconds"] = nullptr;
    if (status.active && status.currentZoneTargetWaterMl != 0)
        activity["targetWaterMl"] = status.currentZoneTargetWaterMl;
    else activity["targetWaterMl"] = nullptr;
    uint64_t pulses = 0;
    uint64_t water = 0;
    for (uint8_t index = 0; index < status.stepCount; ++index) {
        pulses += status.zones[index].pulseCount;
        water += status.zones[index].estimatedWaterMl;
    }
    activity["pulseCount"] = pulses > UINT32_MAX ? UINT32_MAX : pulses;
    activity["estimatedWaterMl"] = water > UINT32_MAX ? UINT32_MAX : water;
    if (status.active && (status.state == WateringState::WaitingForFlow ||
                          status.state == WateringState::WateringZone))
        activity["flowMlPerMinute"] = status.currentFlowMlPerMinute;
    else activity["flowMlPerMinute"] = nullptr;
    bool lowActive = false;
    bool highActive = false;
    if (status.currentStepIndex < status.stepCount) {
        lowActive = status.zones[status.currentStepIndex].lowFlowActive;
        highActive = status.zones[status.currentStepIndex].highFlowActive;
    }
    activity["lowFlowActive"] = lowActive;
    activity["highFlowActive"] = highActive;
    JsonArray steps = activity["steps"].to<JsonArray>();
    for (uint8_t index = 0; index < status.stepCount; ++index) {
        const ZoneWateringSummary& zone = status.zones[index];
        JsonObject item = steps.add<JsonObject>();
        item["zoneId"] = zone.zoneId;
        item["targetSeconds"] = zone.plannedDurationSec;
        if (zone.targetWaterMl) item["targetWaterMl"] = zone.targetWaterMl;
        else item["targetWaterMl"] = nullptr;
        item["status"] = !status.active || index < status.currentStepIndex
                             ? "completed"
                             : index == status.currentStepIndex ? "current" : "pending";
    }
    JsonArray faults = document["faults"].to<JsonArray>();
    if (!Esp32BaseRtc::isAvailable()) faults.add("rtc_unavailable");
    if (!time.synced) faults.add("time_unavailable");
    if (app_->schedulerTimeState() == WateringScheduler::TimeState::RtcRollback)
        faults.add("rtc_rollback");
    if (app_->unexpectedFlowAlarm()) faults.add("unexpected_flow");
    if (!config) faults.add("configuration_storage");
    if (app_->schedulerStorageFault()) faults.add("scheduler_storage");
    if (app_->recordStorageFault()) faults.add("record_storage");
    if (app_->eventStorageFault()) faults.add("event_storage");
    char value[4096]{};
    serializeJson(document, value, sizeof(value));
    publishState("state.runtime", value);
}

void IrrigationMqttAdapter::publishPlans() {
    const IrrigationConfig* config = app_->configuration();
    if (!connected_ || !config) return;
    JsonDocument document;
    document["revision"] = config->revision;
    JsonArray plans = document["plans"].to<JsonArray>();
    for (const WateringPlan& plan : config->plans) {
        if (!plan.configured) continue;
        JsonObject item = plans.add<JsonObject>();
        item["id"] = plan.id;
        item["name"] = plan.name.data();
        item["automaticEnabled"] = plan.scheduleEnabled;
        JsonArray starts = item["startMinutes"].to<JsonArray>();
        for (uint16_t minute : plan.startMinutes)
            if (minute != kUnusedStartMinute) starts.add(minute);
        JsonArray zones = item["zones"].to<JsonArray>();
        for (uint8_t index = 0; index < config->zones.size(); ++index) {
            if (!config->zones[index].enabled || plan.zoneDurationMinutes[index] == 0)
                continue;
            JsonObject zone = zones.add<JsonObject>();
            zone["zoneId"] = config->zones[index].id;
            zone["durationMinutes"] = plan.zoneDurationMinutes[index];
        }
    }
    char value[3072]{};
    serializeJson(document, value, sizeof(value));
    publishState("parameter.plans", value);
}

