tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationMqttAdapter.cpp
void IrrigationMqttAdapter::publishAutomatic() {
    if (!connected_) return;
    const AutomaticWateringState automatic = app_->automaticWateringState();
    JsonDocument document;
    document["mode"] = automaticModeName(automatic.mode);
    if (automatic.mode == AutomaticWateringMode::PausedUntil)
        document["resumeAtEpoch"] = automatic.resumeAtEpoch;
    else document["resumeAtEpoch"] = nullptr;
    char value[128]{};
    serializeJson(document, value, sizeof(value));
    publishState("parameter.automatic-watering", value);
}

void IrrigationMqttAdapter::publishZones() {
    const IrrigationConfig* config = app_->configuration();
    if (!connected_ || !config) return;
    JsonDocument document;
    JsonArray zones = document["zones"].to<JsonArray>();
    for (const ZoneConfig& zone : config->zones) {
        if (!zone.enabled) continue;
        JsonObject item = zones.add<JsonObject>();
        item["zoneId"] = zone.id;
        item["name"] = zone.name.data();
    }
    char value[1024]{};
    serializeJson(document, value, sizeof(value));
    publishState("state.zones", value);
}

void IrrigationMqttAdapter::publishZoneMaintenance() {
    const IrrigationConfig* config = app_->configuration();
    if (!connected_ || !config) return;
    JsonDocument document;
    JsonArray zones = document["zones"].to<JsonArray>();
    for (const ZoneConfig& zone : config->zones) {
        if (!zone.enabled) continue;
        JsonObject item = zones.add<JsonObject>();
        item["zoneId"] = zone.id;
        if (zone.baselinePulseRateX10000 == 0) {
            item["baselinePulseRateX10000"] = nullptr;
            item["baselineFlowMlPerMinute"] = nullptr;
        } else {
            uint32_t flow = 0;
            FlowMonitor::pulseRateX10000ToFlowMlPerMinute(
                zone.baselinePulseRateX10000, config->flowMeter.pulsesPerLiterX100,
                flow);
            item["baselinePulseRateX10000"] = zone.baselinePulseRateX10000;
            item["baselineFlowMlPerMinute"] = flow;
        }
    }
    char value[1536]{};
    serializeJson(document, value, sizeof(value));
    publishState("state.zone-maintenance", value);
}

void IrrigationMqttAdapter::publishCalibration() {
    const IrrigationConfig* config = app_->configuration();
    if (!connected_ || !config) return;
    JsonDocument document;
    document["coefficientPulsesPerLiterX100"] = config->flowMeter.pulsesPerLiterX100;
    document["startupPulseCount"] = config->flowMeter.calibrationStartupPulseCount;
    document["startupWaterMl"] = config->flowMeter.calibrationStartupWaterMl;
    char value[256]{};
    serializeJson(document, value, sizeof(value));
    publishState("state.calibration", value);
}

void IrrigationMqttAdapter::publishSystemParameters() {
    const IrrigationConfig* config = app_->configuration();
    if (!connected_ || !config) return;
    JsonDocument document;
    JsonObject valve = document["valve"].to<JsonObject>();
    valve["pullInTimeMs"] = config->valveDrive.pullInTimeMs;
    valve["switchDelayMs"] = config->valveDrive.switchDelayMs;
    valve["pwmFrequencyHz"] = config->valveDrive.pwmFrequencyHz;
    valve["holdDutyPercent"] = config->valveDrive.holdDutyPercent;
    JsonObject pump = document["pump"].to<JsonObject>();
    pump["enabled"] = config->pump.enabled;
    pump["startDelayMs"] = config->pump.startDelayMs;
    pump["stopToValveCloseDelayMs"] = config->pump.stopToValveCloseDelayMs;
    JsonObject meter = document["meter"].to<JsonObject>();
    meter["pulsesPerLiterX100"] = config->flowMeter.pulsesPerLiterX100;
    meter["calibrationWindowSeconds"] = config->calibrationStability.windowSec;
    meter["calibrationRequiredWindows"] = config->calibrationStability.requiredWindows;
    meter["calibrationAllowedVariationPercent"] =
        config->calibrationStability.allowedVariationPercent;
    meter["flowStartTimeoutSeconds"] = config->flowProtection.flowStartTimeoutSec;
    meter["noFlowTimeoutSeconds"] = config->flowProtection.noFlowTimeoutSec;
    JsonObject flow = document["flow"].to<JsonObject>();
    flow["unexpectedFlowDelaySeconds"] = config->flowProtection.unexpectedFlowDelaySec;
    flow["unexpectedFlowWindowSeconds"] = config->flowProtection.unexpectedFlowWindowSec;
    flow["unexpectedFlowPulseCount"] = config->flowProtection.unexpectedFlowPulseCount;
    flow["deviationConfirmSeconds"] = config->flowProtection.flowDeviationConfirmSec;
    flow["lowFlowPercent"] = config->flowProtection.lowFlowPercent;
    flow["highFlowPercent"] = config->flowProtection.highFlowPercent;
    flow["lowFlowAction"] = flowActionName(config->flowProtection.lowFlowAction);
    flow["highFlowAction"] = flowActionName(config->flowProtection.highFlowAction);
    JsonObject limits = document["limits"].to<JsonObject>();
    limits["maximumZoneDurationMinutes"] = config->runLimits.maximumZoneDurationMinutes;
    limits["maximumSingleOutputLiters"] = config->runLimits.maximumSingleOutputLiters;
    JsonObject system = document["system"].to<JsonObject>();
    system["rtcRollbackThresholdMinutes"] = config->timeSafety.rtcRollbackThresholdMinutes;
    system["aliveCheckpointHours"] = config->timeSafety.aliveCheckpointHours;
    char value[2048]{};
    serializeJson(document, value, sizeof(value));
    publishState("state.system-parameters", value);
}

void IrrigationMqttAdapter::prepareWateringEventCursor() {
    Esp32BaseRecordStore::StoreStatus status{};
    if (!app_->readWateringRecordStoreStatus(status) || status.recordCount == 0) {
        wateringEventCursor_.prepare(0, 0, 0, 0);
        return;
    }
    const uint32_t cursor = preferences_.getUInt("watering_cursor", 0);
    wateringEventCursor_.prepare(cursor, status.oldestRecordId,
                                 status.newestRecordId, status.recordCount);
}

void IrrigationMqttAdapter::publishNextWateringEvent() {
    if (!connected_ || wateringEventCursor_.awaitingAck()) return;
    if (wateringEventCursor_.nextRecordId() == 0) {
        const uint32_t now = millis();
        if (static_cast<uint32_t>(now - lastWateringEventPollMs_) < 1000U) return;
        lastWateringEventPollMs_ = now;
        prepareWateringEventCursor();
    }
    if (wateringEventCursor_.nextRecordId() != 0)
        publishWateringEvent(wateringEventCursor_.nextRecordId());
}

