tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationMqttAdapter.cpp
bool IrrigationMqttAdapter::publishWateringEvent(uint32_t recordId) {
    StoredWateringRecord record{};
    const auto read = app_->readWateringRecordById(recordId, record);
    if (read != Esp32BaseRecordStore::RecordReadResult::Found) {
        if (read == Esp32BaseRecordStore::RecordReadResult::NotFound ||
            read == Esp32BaseRecordStore::RecordReadResult::Corrupt) {
            Esp32BaseRecordStore::StoreStatus status{};
            if (app_->readWateringRecordStoreStatus(status) &&
                recordId <= status.newestRecordId) {
                const bool saved = preferences_.putUInt("watering_cursor", recordId) ==
                                   sizeof(recordId);
                wateringEventCursor_.skipRecord(recordId, status.newestRecordId, saved);
            } else {
                wateringEventCursor_.skipRecord(recordId, 0, false);
            }
        }
        return false;
    }
    uint32_t completedEpoch = 0;
    uint32_t startedEpoch = 0;
    if (!Esp32BaseRecordStore::resolveCompletedEpoch(record.timing, completedEpoch) ||
        !Esp32BaseRecordStore::resolveStartedEpoch(record.timing, startedEpoch))
        return false;

    char completedAt[25]{};
    char startedAt[25]{};
    char eventId[37]{};
    if (!IrrigationPlatformProtocol::formatUtcIso8601(
            completedEpoch, completedAt, sizeof(completedAt)) ||
        !IrrigationPlatformProtocol::formatUtcIso8601(
            startedEpoch, startedAt, sizeof(startedAt)))
        return false;
    makeWateringEventId(recordId, record.timing, eventId, sizeof(eventId));

    JsonDocument document;
    document["protocol"] = IrrigationPlatformProtocol::kProtocol;
    document["connectionId"] = connectionId_.data();
    document["eventId"] = eventId;
    document["eventKey"] = record.payload.result == WateringResult::Completed
                               ? "watering.completed"
                           : record.payload.result == WateringResult::Stopped
                               ? "watering.stopped"
                               : "watering.failed";
    document["observedAt"] = completedAt;
    JsonObject data = document["data"].to<JsonObject>();
    data["source"] = wateringSourceName(record.payload.source);
    if (record.payload.planId != 0) data["planId"] = record.payload.planId;
    data["startedAt"] = startedAt;
    data["completedAt"] = completedAt;
    data["result"] = wateringResultName(record.payload.result);
    data["reason"] = record.payload.result == WateringResult::Completed
                         ? "completed"
                     : record.payload.result == WateringResult::Stopped
                         ? "stopped"
                         : wateringFailure(record.payload.stopReason);
    JsonArray zones = data["zones"].to<JsonArray>();
    for (uint8_t index = 0; index < record.payload.zones.size(); ++index) {
        const ZoneWateringRecord& zone = record.payload.zones[index];
        if (zone.plannedDurationSec == 0) continue;
        JsonObject item = zones.add<JsonObject>();
        item["zoneId"] = index + 1U;
        item["zoneName"] = zone.name.data();
        item["targetSeconds"] = zone.plannedDurationSec;
        if (zone.targetWaterMl != 0) item["targetWaterMl"] = zone.targetWaterMl;
        else item["targetWaterMl"] = nullptr;
        item["actualSeconds"] = zone.actualWateringSec;
        item["zoneResult"] = zoneResultName(zone.result);
        item["pulseCount"] = zone.pulseCount;
        item["estimatedWaterMl"] = zone.estimatedWaterMl;
        if ((zone.flags & WateringRecordCodec::kZoneFlagFlowBaselineAvailable) != 0)
            item["baselineFlowMlPerMinute"] = zone.baselineFlowMlPerMinute;
        else item["baselineFlowMlPerMinute"] = nullptr;
        item["averageFlowMlPerMinute"] = zone.actualWateringSec != 0
                                             ? zone.averageFlowMlPerMinute
                                             : 0;
        item["lowFlowDetected"] =
            (zone.flags & WateringRecordCodec::kZoneFlagLowFlow) != 0;
        item["highFlowDetected"] =
            (zone.flags & WateringRecordCodec::kZoneFlagHighFlow) != 0;
    }
    char payload[4096]{};
    const std::size_t written = serializeJson(document, payload, sizeof(payload));
    if (written == 0 || written >= sizeof(payload) - 1U) return false;
    char topic[192]{};
    makeTopic(IrrigationMqttCore::Channel::Event, topic, sizeof(topic));
    const auto policy =
        IrrigationMqttCore::publicationPolicy(IrrigationMqttCore::Channel::Event);
    const int messageId = esp_mqtt_client_enqueue(
        client_, topic, payload, static_cast<int>(written), policy.qos,
        policy.retain, true);
    if (messageId < 0) return false;
    wateringEventCursor_.enqueued(messageId, recordId);
    return true;
}

void IrrigationMqttAdapter::prepareAppEventCursor() {
    Esp32BaseAppEvents::AppEventsStatus status{};
    if (!app_->readEventStatus(status) || status.eventStore.recordCount == 0) {
        appEventCursor_.prepare(0, 0, 0, 0);
        return;
    }
    const uint32_t cursor = preferences_.getUInt("app_evt_cursor", 0);
    appEventCursor_.prepare(cursor, status.eventStore.oldestRecordId,
                            status.eventStore.newestRecordId,
                            status.eventStore.recordCount);
}

void IrrigationMqttAdapter::publishNextAppEvent() {
    if (!connected_ || appEventCursor_.awaitingAck()) return;
    if (appEventCursor_.nextRecordId() == 0) {
        const uint32_t now = millis();
        if (static_cast<uint32_t>(now - lastAppEventPollMs_) < 1000U) return;
        lastAppEventPollMs_ = now;
        prepareAppEventCursor();
    }
    if (appEventCursor_.nextRecordId() != 0)
        publishAppEvent(appEventCursor_.nextRecordId());
}

bool IrrigationMqttAdapter::publishAppEvent(uint32_t recordId) {
    Esp32BaseAppEvents::EventRecord event{};
    const auto read = Esp32BaseAppEvents::readById(recordId, event);
    if (read != Esp32BaseAppEvents::EventReadResult::Found) {
        if (read == Esp32BaseAppEvents::EventReadResult::NotFound ||
            read == Esp32BaseAppEvents::EventReadResult::Corrupt) {
            Esp32BaseAppEvents::AppEventsStatus status{};
            if (app_->readEventStatus(status) &&
                recordId <= status.eventStore.newestRecordId) {
                const bool saved = preferences_.putUInt("app_evt_cursor", recordId) ==
                                   sizeof(recordId);
                appEventCursor_.skipRecord(recordId,
                                           status.eventStore.newestRecordId, saved);
            } else appEventCursor_.skipRecord(recordId, 0, false);
        }
        return false;
    }
    const char* eventKey = appEventKey(event);
    if (!eventKey) {
        Esp32BaseAppEvents::AppEventsStatus status{};
        if (app_->readEventStatus(status)) {
            const bool saved = preferences_.putUInt("app_evt_cursor", recordId) ==
                               sizeof(recordId);
            appEventCursor_.skipRecord(recordId,
                                       status.eventStore.newestRecordId, saved);
        }
        return false;
    }
    uint32_t observedEpoch = 0;
    if (!Esp32BaseRecordStore::resolveCompletedEpoch(event.timing, observedEpoch))
        return false;
    char observed[25]{};
    char eventId[37]{};
    if (!IrrigationPlatformProtocol::formatUtcIso8601(
            observedEpoch, observed, sizeof(observed))) return false;
    makeAppEventId(recordId, event.timing, eventId, sizeof(eventId));

