tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationMqttAdapter.cpp
    JsonDocument document;
    document["protocol"] = IrrigationPlatformProtocol::kProtocol;
    document["connectionId"] = connectionId_.data();
    document["eventId"] = eventId;
    document["eventKey"] = eventKey;
    document["observedAt"] = observed;
    JsonObject data = document["data"].to<JsonObject>();
    data["objectId"] = event.objectId;
    data["reasonCode"] = event.reasonCode;
    data["value1"] = event.value1;
    data["value2"] = event.value2;
    data["result"] = event.eventKind == Esp32BaseAppEvents::EventKind::ConditionRecovered
                         ? "recovered"
                         : "recorded";
    if (IrrigationEvents::hasWateringContext(event)) {
        data["source"] = wateringSourceName(IrrigationEvents::wateringSource(event));
        const uint8_t planId = IrrigationEvents::wateringPlanId(event);
        if (planId != 0) data["planId"] = planId;
    }
    char payload[1024]{};
    const std::size_t written = serializeJson(document, payload, sizeof(payload));
    if (written == 0 || written >= sizeof(payload) - 1U) return false;
    char topic[192]{};
    makeTopic(IrrigationMqttCore::Channel::Event, topic, sizeof(topic));
    const auto policy =
        IrrigationMqttCore::publicationPolicy(IrrigationMqttCore::Channel::Event);
    const int messageId = esp_mqtt_client_enqueue(
        client_, topic, payload, static_cast<int>(written), policy.qos,
        policy.retain, true);
    if (messageId < 0) return false;
    appEventCursor_.enqueued(messageId, recordId);
    return true;
}

const char* IrrigationMqttAdapter::appEventKey(
    const Esp32BaseAppEvents::EventRecord& event) const {
    using EventCode = IrrigationEvents::EventCode;
    using ReasonCode = IrrigationEvents::ReasonCode;
    switch (static_cast<EventCode>(event.eventCode)) {
        case EventCode::AutomaticWateringStateChanged:
            return event.reasonCode == static_cast<uint32_t>(ReasonCode::PausedIndefinitely) ||
                           event.reasonCode == static_cast<uint32_t>(ReasonCode::PausedUntil)
                       ? "automatic.paused"
                       : "automatic.resumed";
        case EventCode::AutomaticPlanSkipped: return "automatic.plan-skipped";
        case EventCode::FlowDeviation:
            return event.reasonCode == static_cast<uint32_t>(ReasonCode::LowFlow)
                       ? "flow.low"
                       : "flow.high";
        case EventCode::ClosedValveFlow:
            return event.eventKind == Esp32BaseAppEvents::EventKind::ConditionRecovered
                       ? "flow.unexpected-cleared"
                       : "flow.unexpected";
        case EventCode::FlowCalibrationSaved: return "calibration.result-saved";
        case EventCode::ZoneFlowSaved: return "zone.baseline-saved";
        case EventCode::ConfigurationChanged:
            if (event.reasonCode == static_cast<uint32_t>(ReasonCode::PlanCreated) ||
                event.reasonCode == static_cast<uint32_t>(ReasonCode::PlanUpdated) ||
                event.reasonCode == static_cast<uint32_t>(ReasonCode::PlanDeleted))
                return "configuration.plans-changed";
            return event.reasonCode == static_cast<uint32_t>(ReasonCode::ZoneUpdated)
                       ? "configuration.zones-changed"
                       : "configuration.system-parameters-changed";
        case EventCode::WateringRecordSaveFailed:
        case EventCode::SchedulerStateSaveFailed: return "storage.business-failed";
        case EventCode::WateringStoppedAbnormally:
            if (event.reasonCode == static_cast<uint32_t>(ReasonCode::FlowStartTimeout) ||
                event.reasonCode == static_cast<uint32_t>(ReasonCode::NoFlowTimeout))
                return "flow.no-flow";
            if (event.reasonCode == static_cast<uint32_t>(ReasonCode::LowFlow))
                return "flow.low";
            if (event.reasonCode == static_cast<uint32_t>(ReasonCode::HighFlow))
                return "flow.high";
            return nullptr;
        default: return nullptr;
    }
}

void IrrigationMqttAdapter::makeWateringEventId(
    uint32_t recordId,
    const Esp32BaseRecordStore::RecordTiming& timing,
    char* output,
    std::size_t size) const {
    char identity[160]{};
    std::snprintf(identity, sizeof(identity), "%s|watering|%lu|%lu|%lu|%lu",
                  IRRIGATION_MQTT_DEVICE_ID, static_cast<unsigned long>(recordId),
                  static_cast<unsigned long>(timing.completedBootId),
                  static_cast<unsigned long>(timing.completedUptimeSec),
                  static_cast<unsigned long>(timing.completedEpochSec));
    uint8_t digest[32]{};
    mbedtls_sha256_ret(reinterpret_cast<const unsigned char*>(identity),
                       std::strlen(identity), digest, 0);
    digest[6] = static_cast<uint8_t>((digest[6] & 0x0FU) | 0x50U);
    digest[8] = static_cast<uint8_t>((digest[8] & 0x3FU) | 0x80U);
    std::snprintf(output, size,
                  "%02x%02x%02x%02x-%02x%02x-%02x%02x-%02x%02x-%02x%02x%02x%02x%02x%02x",
                  digest[0], digest[1], digest[2], digest[3], digest[4], digest[5],
                  digest[6], digest[7], digest[8], digest[9], digest[10], digest[11],
                  digest[12], digest[13], digest[14], digest[15]);
}

void IrrigationMqttAdapter::makeAppEventId(
    uint32_t recordId,
    const Esp32BaseRecordStore::RecordTiming& timing,
    char* output,
    std::size_t size) const {
    char identity[160]{};
    std::snprintf(identity, sizeof(identity), "%s|app-event|%lu|%lu|%lu|%lu",
                  IRRIGATION_MQTT_DEVICE_ID, static_cast<unsigned long>(recordId),
                  static_cast<unsigned long>(timing.completedBootId),
                  static_cast<unsigned long>(timing.completedUptimeSec),
                  static_cast<unsigned long>(timing.completedEpochSec));
    uint8_t digest[32]{};
    mbedtls_sha256_ret(reinterpret_cast<const unsigned char*>(identity),
                       std::strlen(identity), digest, 0);
    digest[6] = static_cast<uint8_t>((digest[6] & 0x0FU) | 0x50U);
    digest[8] = static_cast<uint8_t>((digest[8] & 0x3FU) | 0x80U);
    std::snprintf(output, size,
                  "%02x%02x%02x%02x-%02x%02x-%02x%02x-%02x%02x-%02x%02x%02x%02x%02x%02x",
                  digest[0], digest[1], digest[2], digest[3], digest[4], digest[5],
                  digest[6], digest[7], digest[8], digest[9], digest[10], digest[11],
                  digest[12], digest[13], digest[14], digest[15]);
}

