tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationMqttAdapter.cpp
void IrrigationMqttAdapter::publishState(const char* capabilityKey,
                                         const char* valueJson) {
    char observed[25]{};
    if (!connected_ || !observedAt(observed, sizeof(observed))) return;
    char payload[4608]{};
    const int written = std::snprintf(
        payload, sizeof(payload),
        "{\"protocol\":\"%s\",\"connectionId\":\"%s\",\"capabilityKey\":\"%s\",\"seq\":%lu,\"value\":%s,\"observedAt\":\"%s\"}",
        IrrigationPlatformProtocol::kProtocol, connectionId_.data(), capabilityKey,
        static_cast<unsigned long>(seq_++), valueJson, observed);
    if (written > 0 && static_cast<std::size_t>(written) < sizeof(payload))
        enqueue(IrrigationMqttCore::Channel::State, payload);
}

void IrrigationMqttAdapter::publishAvailability(bool online, const char* reason) {
    char observed[25]{};
    if (!observedAt(observed, sizeof(observed))) return;
    char payload[320]{};
    if (online) {
        std::snprintf(payload, sizeof(payload),
                      "{\"protocol\":\"%s\",\"online\":true,\"connectionId\":\"%s\",\"observedAt\":\"%s\"}",
                      IrrigationPlatformProtocol::kProtocol, connectionId_.data(), observed);
    } else {
        std::snprintf(payload, sizeof(payload),
                      "{\"protocol\":\"%s\",\"online\":false,\"connectionId\":\"%s\",\"reason\":\"%s\",\"observedAt\":\"%s\"}",
                      IrrigationPlatformProtocol::kProtocol, connectionId_.data(),
                      reason ? reason : "shutdown", observed);
    }
    enqueue(IrrigationMqttCore::Channel::Availability, payload);
}

bool IrrigationMqttAdapter::enqueue(IrrigationMqttCore::Channel channel,
                                    const char* payload) {
    if (!connected_ || !client_ || !payload) return false;
    char topic[192]{};
    makeTopic(channel, topic, sizeof(topic));
    const auto policy = IrrigationMqttCore::publicationPolicy(channel);
    return esp_mqtt_client_enqueue(client_, topic, payload, 0, policy.qos,
                                   policy.retain, true) >= 0;
}

bool IrrigationMqttAdapter::observedAt(char* output, std::size_t size) {
    const Esp32BaseTime::Snapshot now = Esp32BaseTime::snapshot();
    uint32_t epoch = 0;
    if (now.synced) {
        lastTrustedEpoch_ = now.epochSec;
        lastTrustedMillis_ = millis();
        epoch = now.epochSec;
    } else if (lastTrustedEpoch_ != 0) {
        epoch = lastTrustedEpoch_ +
                static_cast<uint32_t>(millis() - lastTrustedMillis_) / 1000U;
    }
    return epoch != 0 &&
           IrrigationPlatformProtocol::formatUtcIso8601(epoch, output, size);
}

uint64_t IrrigationMqttAdapter::nowMs() const {
    const Esp32BaseTime::Snapshot now = Esp32BaseTime::snapshot();
    return now.synced ? static_cast<uint64_t>(now.epochSec) * 1000ULL : 0;
}

void IrrigationMqttAdapter::makeConnectionId() {
    uint8_t bytes[16]{};
    esp_fill_random(bytes, sizeof(bytes));
    bytes[6] = static_cast<uint8_t>((bytes[6] & 0x0FU) | 0x40U);
    bytes[8] = static_cast<uint8_t>((bytes[8] & 0x3FU) | 0x80U);
    std::snprintf(connectionId_.data(), connectionId_.size(),
                  "%02x%02x%02x%02x-%02x%02x-%02x%02x-%02x%02x-%02x%02x%02x%02x%02x%02x",
                  bytes[0], bytes[1], bytes[2], bytes[3], bytes[4], bytes[5],
                  bytes[6], bytes[7], bytes[8], bytes[9], bytes[10], bytes[11],
                  bytes[12], bytes[13], bytes[14], bytes[15]);
    seq_ = 0;
}

void IrrigationMqttAdapter::makeTopic(IrrigationMqttCore::Channel channel,
                                      char* output,
                                      std::size_t size) const {
    if (!IrrigationPlatformProtocol::formatTopic(
            IRRIGATION_MQTT_DEVICE_ID, IrrigationMqttCore::channelName(channel),
            output, size) && size != 0)
        output[0] = '\0';
}

const char* IrrigationMqttAdapter::phaseName(WateringState state) const {
    switch (state) {
        case WateringState::StartingZone: return "starting";
        case WateringState::WaitingForFlow: return "waiting-flow";
        case WateringState::WateringZone: return "watering";
        case WateringState::SwitchingZone: return "switching";
        case WateringState::StoppingZone: return "stopping";
        default: return "idle";
    }
}

const char* IrrigationMqttAdapter::activityKind(const WateringStatus& status) const {
    if (!status.active) return "idle";
    if (status.purpose == WateringPurpose::FlowCalibration) return "calibration";
    if (status.purpose == WateringPurpose::ZoneFlowLearning) return "learning";
    if (status.source == WateringSource::AutomaticPlan) return "automatic";
    if (status.source == WateringSource::SingleOutput) return "single-output";
    return "manual";
}

const char* IrrigationMqttAdapter::rejectionForStart(
    WateringStartResult result) const {
    switch (result) {
        case WateringStartResult::NotReady: return "not_ready";
        case WateringStartResult::Busy:
        case WateringStartResult::PreviousResultPending: return "busy";
        case WateringStartResult::InvalidRequest: return "invalid_parameters";
        case WateringStartResult::HardwareFailure: return "hardware_failure";
        default: return "internal_state";
    }
}
